backwardFacingStep/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0 0 0)
    (4 0 0)
    (4 2 0)
    (0 2 0)
    (0 0 0.1)
    (4 0 0.1)
    (4 2 0.1)
    (0 2 0.1)

    (10 0 0)
    (10 2 0)
    (10 0 0.1)
    (10 2 0.1)

    (4 -2 0)
    (10 -2 0)
    (4 -2 0.1)
    (10 -2 0.1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 20 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (60 20 1) simpleGrading (1 1 1)
    hex (12 13 8 1 14 15 10 5) (60 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 10 11 9)
            (8 13 15 10)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (9 11 6 2)
        );
    }
    leftBottomWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    rightBottomWall
    {
        type wall;
        faces
        (
            (12 13 15 14)
        );
    }
    step
    {
        type wall;
        faces
        (
            (1 12 5 14)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
	    (1 8 9 2)
	    (5 10 11 6)
	    (1 12 13 8)
	    (5 14 15 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
